#Домашнее задание "Циклы". Часть 5

#Задание 1

print("Меню:")
print("Фигура а - нажми 1; Фигура б - нажми 2; Фигура в - нажми 3; Фигура г - нажми 4; Фигура д - нажми 5;")
print("Фигура е - нажми 6; Фигура ж - нажми 7; Фигура з - нажми 8; Фигура и - нажми 9; Фигура к - нажми 10;")
s = input("Выберите фигуру из списка: ")

if s == "1":
    print(" " * 20, "-" * 10)
    i = 1
    while i < 7:
        print(" " * 20 + "|", " " * i + "*" * (7 - i), "|")
        i += 1
    print(" " * 20, "-" * 10)


elif s == "2":
    print(" " * 20, "-" * 10)
    i = 0
    while i < 7:
        print(" " * 20 + "|", "*" * (i + 1) + " " * (7 - i) + "|")
        i += 1
    print(" " * 20, "-" * 10)


elif s == "3":
    print(" " * 20, "-" * 10)
    for i in range(7, 0, -2):
        print(" " * 20 + "|", " " * ((10 - i) // 2) + "*" * i, " " * ((10 - i) // 2) + "|")
    for i in range(5, 0, -2):
        print(" " * 20 + "|", " " * ((10 - i) // 2) + " " * i, " " * ((10 - i) // 2) + "|")
    print(" " * 20, "-" * 10)


elif s == "4":
    print(" " * 20, "-" * 10)
    for i in range(1, 4, 2):
        print(" " * 20 + "|", " " * ((7 - i) // 2) + " " * i, " " * ((7 - i) // 2) + "|")
    for i in range(1, 8, 2):
        print(" " * 20 + "|", " " * ((7 - i) // 2) + "*" * i, " " * ((7 - i) // 2) + "|")
    print(" " * 20, "-" * 10)


elif s == "5":
    print(" " * 20, "-" * 10)
    for i in range(7, 0, -2):
        print(" " * 20 + "|", " " * ((7 - i) // 2) + "*" * i, " " * ((7 - i) // 2) + "|")
    for i in range(1, 8, 2):
        print(" " * 20 + "|", " " * ((7 - i) // 2) + "*" * i, " " * ((7 - i) // 2) + "|")
    print(" " * 20, "-" * 10)


elif s == "6":
    print(" " * 20, "-" * 13)
    i = 1
    while i < 8:
        if i <= 4:
            print(" " * 20 + "|", "*" * i, " " * (8 - i * 2), "*" * i, "|")
        else:
            print(" " * 20 + "|", "*" * (8 - i), " " * ((i - 4) * 2), "*" * (8 - i), "|")
        i += 1
    print(" " * 20, "-" * 13)


elif s == "7":
    print(" " * 20, "-" * 13)
    i = 1
    while i < 8:
        print(" " * 20, "|", "*" * i if i <= 3 else "*" * (8 - i), " " * (8 - i) if i <= 3 else " " * i, "|")
        i += 1
    print(" " * 20, "-" * 13)


elif s == "8":
    print(" " * 20, "-" * 13)
    i = 1
    while i < 8:
        if i <= 4:
            print(" " * 20 + "|", " " * i, " " * (8 - i * 2), "*" * i, "|")
        else:
            print(" " * 20 + "|", " " * (8 - i), " " * ((i - 4) * 2), "*" * (8 - i), "|")
        i += 1
    print(" " * 20, "-" * 13)


elif s == "9":
    print(" " * 20, "-" * 12)
    i = 0
    while i < 7:
        print(" " * 20, "|", "*" * i if i >= 7 else "*" * (7 - i) + " " * (i + 1) if i <= 7 else " " * i, "|")
        i += 1
    print(" " * 20, "-" * 12)


elif s == "10":
    print(" " * 20, "-" * 11)
    i = 0
    while i < 7:
        print(" " * 20, "|", "*" * i if i >= 7 else " " * (7 - i - 1) + "*" * (i + 1) if i <= 7 else " " * i, "|")
        i += 1
    print(" " * 20, "-" * 11)


else:
    print("Введены некорректные данные")

