#Домашнее задание "Циклы". часть 3"

#Задание 1

x = input("Введите число х: ")
y = input("Введите число y: ")
res = int(x) ** int(y)
print("Результат: ",res)

#Задание 2

