#Домашнее задание "Циклы". Часть 5

#Задание

print("Меню:")
print("1. Треугольник в правом верхнем углу")
print("2. Треугольник в левом нижнем углу")
print("3. Равносторонний треугольник с основанием по верхнему краю")
print("4. Равносторонний треугольник с основанием по нижнему краю")
print("5. Равносторонние треугольники с основаниями по верхнему и нижнему краям")
print("6. Равносторонние треугольники с основаниями по левому и правому краям")
print("5. Равносторонние треугольники с основаниями по левому краю")
print("5. Равносторонние треугольники с основаниями по правому краю")
print("9. Треугольник в верхнем левом углу")
print("10. Треугольник в нижнем правом углу")
s = input("Выберите фигуру из списка: ")

if s == "1":
    for i in range(7):
     print(" " * i + '*' * (7 - i))
elif s == "2":
    for i in range(7):
     print("*" * (i + 1) + " " * (7 + i))
elif s == "3":
    for i in range(7, 0, -2):
     print(' ' * ((7 - i) // 2) + '*' * i)
elif s == "4":
    for i in range(1, 7, 2):
     print(' ' * ((7 - i) // 2) + '*' * i)
elif s == "5":
    for i in range(7, 0, -2):
     print(' ' * ((7 - i) // 2) + '*' * i)
    for i in range(3, 8, 2):
        print(' ' * ((8 - i) // 2) + '*' * i)
elif s == "6":
    for i in range(1, 7, 2):
     print(' ' * ((7 - i) // 2) + '*' * i)
elif s == "7":

elif s == "8":

elif s == "9":
    for i in range(7):
     print('*' * (7 - i) + ' ' * (i - 1))
elif s == "10":
    for i in range(7):
        print(' ' * (7 - i - 1) + '*' * (i + 1))


else:
    print("Введены некорректные данные")

# for i in range(7):
#     print(" " * i + '*' * (7 - i))                                    1
#
#
# for i in range(7):
#     print("*" * (i + 1) + " " * (7 + i))                              2
#
#
#
# for i in range(7 // 2):
#     print(" " * i + "*" * (2 * (7 // 2 - i) - 1))                     3
#
#
#
# for i in range(7 // 2):
#     print(" " * (7 // 2 - i - 1) + "*" * (2 * i + 1))                 4
#
#
# for i in range(7):
#      print("*" * (7 - i) + " " * (i - 1))                             5
#
#
#
# for i in range(7):
#     print(" " * (7 - i - 1) + "*" * (i + 1))                         6
#
#
#
#
#
#     choice = int(input("Введите свой выбор: "))
